# SetName Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShape..::..SetName Method
DirectShape Class See Also
---
Sets the name for the DirectShape element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void SetName(
	string name
)
```

Visual Basic
---
```text
Public Sub SetName ( _
	name As String _
)
```

Visual C++
---
```text
public:
void SetName(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String The name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShape Class
Autodesk.Revit.DB Namespace